status/2021/26mar21.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-10-28 Sat 04:39 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>20 March 2021 - 26 March 2021</title>
<meta name="author" content="Daniel Kelley" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">20 March 2021 - 26 March 2021</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orge4e0dc3">1. Santa Cruz Weather Station</a></li>
<li><a href="#org1f90d7b">2. EPICS</a>
<ul>
<li><a href="#org1267df8">2.1. u3hv-scpi</a>
<ul>
<li><a href="#orgf85e004">2.1.1. Reimplemented syst:int:show? to accept a channel list</a></li>
<li><a href="#orgc34d91f">2.1.2. Added CodeChecker analysis</a></li>
<li><a href="#orgbd1c294">2.1.3. cleaned up and checked in</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orga8ee2f7">3. Brini Tracker II</a></li>
<li><a href="#orgacf877b">4. wktcolor</a></li>
<li><a href="#org1754f9c">5. Reading</a>
<ul>
<li><a href="#org5435ea7">5.1. I never danced at the White House</a></li>
<li><a href="#org4aaa0c4">5.2. Effective Modern C++</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
Spring has really sprung.
</p>

<div id="outline-container-orge4e0dc3" class="outline-2">
<h2 id="orge4e0dc3"><span class="section-number-2">1.</span> Santa Cruz Weather Station</h2>
<div class="outline-text-2" id="text-1">
<p>
Mast sensors still broken
</p>
</div>
</div>
<div id="outline-container-org1f90d7b" class="outline-2">
<h2 id="org1f90d7b"><span class="section-number-2">2.</span> EPICS</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org1267df8" class="outline-3">
<h3 id="org1267df8"><span class="section-number-3">2.1.</span> u3hv-scpi</h3>
<div class="outline-text-3" id="text-2-1">
</div>
<div id="outline-container-orgf85e004" class="outline-4">
<h4 id="orgf85e004"><span class="section-number-4">2.1.1.</span> Reimplemented syst:int:show? to accept a channel list</h4>
</div>
<div id="outline-container-orgc34d91f" class="outline-4">
<h4 id="orgc34d91f"><span class="section-number-4">2.1.2.</span> Added CodeChecker analysis</h4>
<div class="outline-text-4" id="text-2-1-2">
<p>
Fixed problems reported by same
</p>
</div>
</div>
<div id="outline-container-orgbd1c294" class="outline-4">
<h4 id="orgbd1c294"><span class="section-number-4">2.1.3.</span> cleaned up and checked in</h4>
</div>
</div>
</div>
<div id="outline-container-orga8ee2f7" class="outline-2">
<h2 id="orga8ee2f7"><span class="section-number-2">3.</span> Brini Tracker II</h2>
<div class="outline-text-2" id="text-3">
<p>
Buttons still work after ten weeks week of runtime. GPS display update
seems to be intermittent as it is not working at this moment. But the date
<b>is</b> correct.
</p>
</div>
</div>

<div id="outline-container-orgacf877b" class="outline-2">
<h2 id="orgacf877b"><span class="section-number-2">4.</span> wktcolor</h2>
<div class="outline-text-2" id="text-4">
<p>
Started outline. Will use "modern C++" as the underlying libraries needed
are in C++. Initial plan was to use CGAL (<a href="http://www.gcal.org">http://www.gcal.org</a>) but some
CGAL headers (like the exact Kernel) appear to hang clang-analyzer, or
at least take over 15 min. to analyze. This seems to me true to CGAL form,
as I recall from the old days when GCC barely supported templates, that a
CGAL compile (if it worked) would take a <b>very</b> long time.
</p>

<p>
Instead of CGAL, will probably use boost graph and geometry libraries.
</p>
</div>
</div>

<div id="outline-container-org1754f9c" class="outline-2">
<h2 id="org1754f9c"><span class="section-number-2">5.</span> Reading</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org5435ea7" class="outline-3">
<h3 id="org5435ea7"><span class="section-number-3">5.1.</span> I never danced at the White House</h3>
<div class="outline-text-3" id="text-5-1">
<p>
<a href="https://www.goodreads.com/book/show/4780762-i-never-danced-at-the-white-house">https://www.goodreads.com/book/show/4780762-i-never-danced-at-the-white-house</a>
</p>
</div>
</div>
<div id="outline-container-org4aaa0c4" class="outline-3">
<h3 id="org4aaa0c4"><span class="section-number-3">5.2.</span> Effective Modern C++</h3>
<div class="outline-text-3" id="text-5-2">
<p>
<a href="https://www.aristeia.com/EMC++.html">https://www.aristeia.com/EMC++.html</a>
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Daniel Kelley</p>
<p class="date">Created: 2023-10-28 Sat 04:39</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>